# Message Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ArgumentException..::..Message Property
ArgumentException Class See Also
---
Gets the error message and the parameter name, or only the error message if no parameter name is set.
**Namespace:** Autodesk.Revit.Exceptions**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public override string Message { get; }
```

Visual Basic
---
```text
Public Overrides ReadOnly Property Message As String
	Get
```

Visual C++
---
```text
public:
virtual property String^ Message {
	String^ get () override;
}
```

# ### Implements
_Exception..::..Message
# Remarks
The text of Message should completely describe the error and should, when possible, explain how to correct it.
# See Also
ArgumentException Class
Autodesk.Revit.Exceptions Namespace